Repository: 3linmr/albaseet_user_guid
Catalog: Downloads/albaseet-master/Selling.Service/Resources/Services/SalesMessageService.*.resx
Languages: ar

# AlreadyHasDocument
source: Cannot create a new {0} because there is already a {0} on the {1}
ar: لا يمكن إنشاء {0} جديدة لأنه قد تم إنشاء {0} على {1} من قبل

# BonusQuantityExceeding
source: Cannot save {0} because it has item ({2}) with bonus quantity ({4} {3}) that is exceeding the bonus quantity ({5} {3}) in {1}
ar: لا يمكن حفط {0} لأنه يحتوي على صنف ({2}) بكمية ({4} {3}) إضافية وهي أكبر من كميته الإضافية في {1} وهي ({5} {3})

# BonusQuantityNotMatchingRemaining
source: Cannot save {0} because it has item ({2}) with bonus quantity ({4} {3}) that is not matching the bonus quantity remaining ({5} {3}) from {1}
ar: لا يمكن حفط {0} لأنها تحتوي على صنف ({2}) بكمية إضافية ({4} {3}) وهي مختلفة من الكمية الإضافية المتبقية من {1} وهي ({5} {3})

# BonusQuantityNotMatchingUnInvoiced
source: Cannot save {0} because it has item ({2}) with bonus quantity ({4} {3}) that is not matching the non invoiced bonus quantity received ({5} {3}) from {1}
ar: لا يمكن حفط {0} لأنها تحتوي على صنف ({2}) بكمية إضافية ({4} {3}) وهي مختلفة من الكمية الإضافية الغير مفوترة من {1} وهي ({5} {3})

# CannotCompletelyFulfillItemFromStore
source: Cannot completely fulfill item {0} with package {1} from the store
ar: لا يمكن إستيفاء كمية صنف {0} بوحدة {1} من المخزن بالكامل

# CannotDecreaseValueOfMemo
source: Cannot decrease the value of {0} because then the value of {1} would be negative
ar: لا يمكن تقليل قيمة {0} لأن حينها ستكون قيمة {1} بالسالب

# CannotDeleteBecauseReturnedAfterInvoice
source: Cannot delete {0} because the parent {1} was returned from
ar: لا يمكن حذف {0} لأنه تم الإرجاع من {1}

# CannotDeleteBecauseSettlementStarted
source: Cannot delete {0} because it has started being settled
ar: لا يمكن حذف {0} لان تم بدء التسديد عليه

# CannotPartiallyFulfillItemFromStore
source: Cannot partially fulfill item {0} with package {1} from the store
ar: لا يمكن إستيفاء كمية صنف {0} بوحدة {1} من المخزن جزئيًا

# CannotUpdateBecauseSettlementStarted
source: Cannot update {0} because it has started being settled
ar: لا يمكن حفظ {0} لان تم بدء التسديد عليه

# CanOnlyCreateOnCreditInvoice
source: {0} can only be created on credit invoices
ar: يمكن إنشاء {0} فقط على فاتورة آجلة

# CollectedValueNotMatchTotalValue
source: The total collected value {1} does not match the net value of {0} {2}
ar: مجموع ما تم تحصيله {1} لا يساوي صافي قيمة {0} {2}

# DeleteCauseBonusQuantityExceed
source: Cannot delete {0} because item ({2}) will have disbursed bonus quantity ({4} {3}) exceeding the bonus quantity ({5} {3}) in {1}
ar: لا يمكن حذف {0} لأن الكمية الإضافية المسلمة من صنف ({2}) ستكون ({4} {3}) وهي أكبر من الكمية في {1} وهي ({5} {3})

# DeleteCauseInvoiceValueNegative
source: Cannot delete {0} because then the value of {1} would be negative
ar: لا يمكن حذف {0} لأن حينها ستكون قيمة {1} بالسالب

# DeleteCauseQuantityExceed
source: Cannot delete {0} because item ({2}) will have disbursed quantity ({4} {3}) exceeding the quantity ({5} {3}) in {1}
ar: لا يمكن حذف {0} لأن الكمية المسلمة من صنف ({2}) ستكون ({4} {3}) وهي أكبر من الكمية في {1} وهي ({5} {3})

# MustHavePaymentMethod
source: Atleast one payment method should be provided
ar: يجب إدخال طريقة قبض واحدة على الأقل

# NoCollectionMethodWithCreditInvoices
source: No Collection methods are allowed in credit invoices
ar: لا يسمح بحفظ طرق قبض في فاتورة آجلة

# NoLongerCanReturn
source: {0} can no longer be returned from
ar: لم يعد بإمكان الإرجاع من {0}

# NoLongerValid
source: {0} is no longer valid
ar: لم يعد {0} ساريًا

# NoPaymentMethodWithCreditInvoices
source: No Payment methods are allowed in credit invoices
ar: لا يسمح بحفظ طرق دفع في فاتورة آجلة

# PaidValueNotMatchTotalValue
source: The total paid value {1} does not match the net value of {0} {2}
ar: مجموع ما تم دفعه {1} لا يساوي صافي قيمة {0} {2}

# QuantityCannotBeChanged
source: Quantities in {0} cannot be changed after being created
ar: لا يمكن تغيير الكميات في {0} بعد الإنشاء

# QuantityExceeding
source: Cannot save {0} because it has item ({2}) with quantity ({4} {3}) that is exceeding the quantity ({5} {3}) in {1}
ar: لا يمكن حفط {0} لأنه يحتوي على صنف ({2}) بكمية ({4} {3}) وهي أكبر من كميته في {1} وهي ({5} {3})

# QuantityNotMatchingRemaining
source: Cannot save {0} because it has item ({2}) with quantity ({4} {3}) that is not matching the quantity remaining ({5} {3}) from {1}
ar: لا يمكن حفط {0} لأنها تحتوي على صنف ({2}) بكمية ({4} {3}) وهي مختلفة من الكمية المتبقية من {1} وهي ({5} {3})

# QuantityNotMatchingUnInvoiced
source: Cannot save {0} because it has item ({2}) with quantity ({4} {3}) that is not matching the non invoiced quantity ({5} {3}) from {1}
ar: لا يمكن حفط {0} لأنها تحتوي على صنف ({2}) بكمية ({4} {3}) وهي مختلفة من الكمية الغير مفوترة من {1} وهي ({5} {3})

# SaveCauseBonusQuantityExceed
source: Cannot save {0} because item ({2}) will have disbursed bonus quantity ({4} {3}) exceeding the bonus quantity ({5} {3}) in {1}
ar: لا يمكن حفظ {0} لأن الكمية الإضافية المسلمة من صنف ({2}) ستكون ({4} {3}) وهي أكبر من الكمية الإضافية في {1} وهي ({5} {3})

# SaveCauseQuantityExceed
source: Cannot save {0} because item ({2}) will have disbursed quantity ({4} {3}) exceeding the quantity ({5} {3}) in {1}
ar: لا يمكن حفظ {0} لأن الكمية المسلمة من صنف ({2}) ستكون ({4} {3}) وهي أكبر من الكمية في {1} وهي ({5} {3})

# StockOutReturnFromReservationInvoiceCreatedBeforeCloseOut
source: Cannot create {0} from {1} before creating a {2}
ar: لا يمكن إنشاء {0} من {1} قبل إنشاء {2}

# ValueExceeding
source: Cannot Save {0} because it has MemoValue ({2}) bigger than {1} net value ({3})
ar: لا يمكن حفظ {0} لان مبلغ الإشعار فيه ({2}) يتجاوز صافي قيمة {1} ({3})

# ValueNotMatchingJournalCredit
source: Cannot save {0} because it has net value not matching the total credit value in Journal
ar: لا يمكن حفظ {0} لأن قيمتها لا تساوي مجموع قيمة الدائن في القيد

# ValueNotMatchingJournalDebit
source: Cannot save {0} because it has net value not matching the total debit value in Journal
ar: لا يمكن حفظ {0} لأن قيمتها لا تساوي مجموع قيمة المدين في القيد
